const { mock } = require('mockjs')
const { handleRandomImage } = require('../utils')

const countryList = [
  {
      "id": "1",
      "txt": "亚洲",
      "curr": false,
      "children": [
          {
              "pid": "1",
              "id": "1",
              "txt": "中国"
          },
          {
              "pid": "1",
              "id": "6",
              "txt": "不丹"
          },
          {
              "pid": "1",
              "id": "7",
              "txt": "东帝汶"
          },
          {
              "pid": "1",
              "id": "9",
              "txt": "乌兹别克斯坦"
          },
          {
              "pid": "1",
              "id": "10",
              "txt": "也门"
          },
          {
              "pid": "1",
              "id": "11",
              "txt": "亚美尼亚"
          },
          {
              "pid": "1",
              "id": "12",
              "txt": "以色列"
          },
          {
              "pid": "1",
              "id": "13",
              "txt": "伊拉克"
          },
          {
              "pid": "1",
              "id": "15",
              "txt": "卡塔尔"
          },
          {
              "pid": "1",
              "id": "16",
              "txt": "印尼"
          },
          {
              "pid": "1",
              "id": "17",
              "txt": "印度"
          },
          {
              "pid": "1",
              "id": "20",
              "txt": "吉尔吉斯斯坦"
          },
          {
              "pid": "1",
              "id": "21",
              "txt": "哈萨克斯坦"
          },
          {
              "pid": "1",
              "id": "22",
              "txt": "土库曼斯坦"
          },
          {
              "pid": "1",
              "id": "23",
              "txt": "土耳其"
          },
          {
              "pid": "1",
              "id": "24",
              "txt": "圣诞岛"
          },
          {
              "pid": "1",
              "id": "25",
              "txt": "塔吉克斯坦"
          },
          {
              "pid": "1",
              "id": "26",
              "txt": "塞浦路斯"
          },
          {
              "pid": "1",
              "id": "27",
              "txt": "孟加拉"
          },
          {
              "pid": "1",
              "id": "28",
              "txt": "尼泊尔"
          },
          {
              "pid": "1",
              "id": "29",
              "txt": "巴勒斯坦"
          },
          {
              "pid": "1",
              "id": "30",
              "txt": "巴基斯坦"
          },
          {
              "pid": "1",
              "id": "31",
              "txt": "巴林"
          },
          {
              "pid": "1",
              "id": "32",
              "txt": "文莱"
          },
          {
              "pid": "1",
              "id": "33",
              "txt": "斯里兰卡"
          },
          {
              "pid": "1",
              "id": "34",
              "txt": "新加坡"
          },
          {
              "pid": "1",
              "id": "35",
              "txt": "日本"
          },
          {
              "pid": "1",
              "id": "36",
              "txt": "朝鲜"
          },
          {
              "pid": "1",
              "id": "37",
              "txt": "柬埔寨"
          },
          {
              "pid": "1",
              "id": "38",
              "txt": "格鲁吉亚"
          },
          {
              "pid": "1",
              "id": "39",
              "txt": "沙特阿拉伯"
          },
          {
              "pid": "1",
              "id": "40",
              "txt": "泰国"
          },
          {
              "pid": "1",
              "id": "42",
              "txt": "科威特"
          },
          {
              "pid": "1",
              "id": "43",
              "txt": "科科斯群岛"
          },
          {
              "pid": "1",
              "id": "44",
              "txt": "约旦"
          },
          {
              "pid": "1",
              "id": "45",
              "txt": "缅甸"
          },
          {
              "pid": "1",
              "id": "46",
              "txt": "老挝"
          },
          {
              "pid": "1",
              "id": "47",
              "txt": "菲律宾"
          },
          {
              "pid": "1",
              "id": "48",
              "txt": "蒙古国"
          },
          {
              "pid": "1",
              "id": "49",
              "txt": "越南"
          },
          {
              "pid": "1",
              "id": "50",
              "txt": "阿塞拜疆"
          },
          {
              "pid": "1",
              "id": "51",
              "txt": "阿富汗"
          },
          {
              "pid": "1",
              "id": "52",
              "txt": "阿曼"
          },
          {
              "pid": "1",
              "id": "54",
              "txt": "阿联酋"
          },
          {
              "pid": "1",
              "id": "55",
              "txt": "韩国"
          },
          {
              "pid": "1",
              "id": "57",
              "txt": "马尔代夫"
          },
          {
              "pid": "1",
              "id": "58",
              "txt": "马来西亚"
          },
          {
              "pid": "1",
              "id": "59",
              "txt": "黎巴嫩"
          },
          {
              "pid": "1",
              "id": "253",
              "txt": "文莱达鲁萨兰国"
          }
      ]
  },
  {
      "id": "2",
      "txt": "欧洲",
      "curr": false,
      "children": [
          {
              "pid": "2",
              "id": "2",
              "txt": "斯瓦尔巴群岛和扬马延岛"
          },
          {
              "pid": "2",
              "id": "143",
              "txt": "丹麦"
          },
          {
              "pid": "2",
              "id": "144",
              "txt": "乌克兰"
          },
          {
              "pid": "2",
              "id": "145",
              "txt": "俄罗斯"
          },
          {
              "pid": "2",
              "id": "146",
              "txt": "保加利亚"
          },
          {
              "pid": "2",
              "id": "147",
              "txt": "克罗地亚"
          },
          {
              "pid": "2",
              "id": "148",
              "txt": "冰岛"
          },
          {
              "pid": "2",
              "id": "149",
              "txt": "列支敦士登"
          },
          {
              "pid": "2",
              "id": "150",
              "txt": "匈牙利"
          },
          {
              "pid": "2",
              "id": "151",
              "txt": "卢森堡"
          },
          {
              "pid": "2",
              "id": "152",
              "txt": "圣马力诺"
          },
          {
              "pid": "2",
              "id": "153",
              "txt": "塞尔维亚"
          },
          {
              "pid": "2",
              "id": "154",
              "txt": "奥兰群岛"
          },
          {
              "pid": "2",
              "id": "155",
              "txt": "奥地利"
          },
          {
              "pid": "2",
              "id": "156",
              "txt": "安道尔"
          },
          {
              "pid": "2",
              "id": "157",
              "txt": "希腊"
          },
          {
              "pid": "2",
              "id": "158",
              "txt": "德国"
          },
          {
              "pid": "2",
              "id": "159",
              "txt": "意大利"
          },
          {
              "pid": "2",
              "id": "160",
              "txt": "拉脱维亚"
          },
          {
              "pid": "2",
              "id": "161",
              "txt": "挪威"
          },
          {
              "pid": "2",
              "id": "162",
              "txt": "捷克"
          },
          {
              "pid": "2",
              "id": "163",
              "txt": "摩尔多瓦"
          },
          {
              "pid": "2",
              "id": "164",
              "txt": "摩纳哥"
          },
          {
              "pid": "2",
              "id": "165",
              "txt": "斯洛伐克"
          },
          {
              "pid": "2",
              "id": "166",
              "txt": "斯洛文尼亚"
          },
          {
              "pid": "2",
              "id": "167",
              "txt": "根西岛"
          },
          {
              "pid": "2",
              "id": "168",
              "txt": "梵蒂冈"
          },
          {
              "pid": "2",
              "id": "169",
              "txt": "比利时"
          },
          {
              "pid": "2",
              "id": "170",
              "txt": "法国"
          },
          {
              "pid": "2",
              "id": "171",
              "txt": "法罗群岛"
          },
          {
              "pid": "2",
              "id": "172",
              "txt": "波兰"
          },
          {
              "pid": "2",
              "id": "174",
              "txt": "泽西岛"
          },
          {
              "pid": "2",
              "id": "175",
              "txt": "爱尔兰"
          },
          {
              "pid": "2",
              "id": "176",
              "txt": "爱沙尼亚"
          },
          {
              "pid": "2",
              "id": "177",
              "txt": "瑞典"
          },
          {
              "pid": "2",
              "id": "178",
              "txt": "瑞士"
          },
          {
              "pid": "2",
              "id": "179",
              "txt": "白俄罗斯"
          },
          {
              "pid": "2",
              "id": "180",
              "txt": "直布罗陀"
          },
          {
              "pid": "2",
              "id": "181",
              "txt": "立陶宛"
          },
          {
              "pid": "2",
              "id": "182",
              "txt": "罗马尼亚"
          },
          {
              "pid": "2",
              "id": "183",
              "txt": "芬兰"
          },
          {
              "pid": "2",
              "id": "184",
              "txt": "英国"
          },
          {
              "pid": "2",
              "id": "185",
              "txt": "荷兰"
          },
          {
              "pid": "2",
              "id": "186",
              "txt": "葡萄牙"
          },
          {
              "pid": "2",
              "id": "187",
              "txt": "西班牙"
          },
          {
              "pid": "2",
              "id": "188",
              "txt": "阿尔巴尼亚"
          },
          {
              "pid": "2",
              "id": "189",
              "txt": "马其顿"
          },
          {
              "pid": "2",
              "id": "190",
              "txt": "马恩岛"
          },
          {
              "pid": "2",
              "id": "191",
              "txt": "马耳他"
          },
          {
              "pid": "2",
              "id": "192",
              "txt": "黑山"
          },
          {
              "pid": "2",
              "id": "254",
              "txt": "波斯尼亚和黑塞哥维那"
          },
          {
              "pid": "2",
              "id": "255",
              "txt": "圣海伦娜"
          }
      ]
  },
  {
      "id": "3",
      "txt": "非洲",
      "curr": false,
      "children": [
          {
              "pid": "3",
              "id": "5",
              "txt": "西撒哈拉"
          },
          {
              "pid": "3",
              "id": "193",
              "txt": "中非"
          },
          {
              "pid": "3",
              "id": "194",
              "txt": "乌干达"
          },
          {
              "pid": "3",
              "id": "195",
              "txt": "乍得"
          },
          {
              "pid": "3",
              "id": "196",
              "txt": "佛得角"
          },
          {
              "pid": "3",
              "id": "197",
              "txt": "冈比亚"
          },
          {
              "pid": "3",
              "id": "198",
              "txt": "几内亚"
          },
          {
              "pid": "3",
              "id": "199",
              "txt": "几内亚比绍"
          },
          {
              "pid": "3",
              "id": "200",
              "txt": "刚果(布)"
          },
          {
              "pid": "3",
              "id": "201",
              "txt": "刚果(金)"
          },
          {
              "pid": "3",
              "id": "202",
              "txt": "利比亚"
          },
          {
              "pid": "3",
              "id": "203",
              "txt": "利比里亚"
          },
          {
              "pid": "3",
              "id": "204",
              "txt": "加纳"
          },
          {
              "pid": "3",
              "id": "205",
              "txt": "加蓬"
          },
          {
              "pid": "3",
              "id": "206",
              "txt": "南苏丹"
          },
          {
              "pid": "3",
              "id": "207",
              "txt": "南非"
          },
          {
              "pid": "3",
              "id": "208",
              "txt": "博茨瓦纳"
          },
          {
              "pid": "3",
              "id": "209",
              "txt": "卢旺达"
          },
          {
              "pid": "3",
              "id": "210",
              "txt": "厄立特里亚"
          },
          {
              "pid": "3",
              "id": "211",
              "txt": "吉布提"
          },
          {
              "pid": "3",
              "id": "212",
              "txt": "喀麦隆"
          },
          {
              "pid": "3",
              "id": "213",
              "txt": "圣多美和普林西比"
          },
          {
              "pid": "3",
              "id": "215",
              "txt": "坦桑尼亚"
          },
          {
              "pid": "3",
              "id": "216",
              "txt": "埃及"
          },
          {
              "pid": "3",
              "id": "217",
              "txt": "埃塞俄比亚"
          },
          {
              "pid": "3",
              "id": "218",
              "txt": "塞内加尔"
          },
          {
              "pid": "3",
              "id": "219",
              "txt": "塞拉利昂"
          },
          {
              "pid": "3",
              "id": "220",
              "txt": "塞舌尔"
          },
          {
              "pid": "3",
              "id": "221",
              "txt": "多哥"
          },
          {
              "pid": "3",
              "id": "222",
              "txt": "安哥拉"
          },
          {
              "pid": "3",
              "id": "223",
              "txt": "尼日利亚"
          },
          {
              "pid": "3",
              "id": "224",
              "txt": "尼日尔"
          },
          {
              "pid": "3",
              "id": "225",
              "txt": "布基纳法索"
          },
          {
              "pid": "3",
              "id": "226",
              "txt": "布隆迪"
          },
          {
              "pid": "3",
              "id": "227",
              "txt": "摩洛哥"
          },
          {
              "pid": "3",
              "id": "228",
              "txt": "斯威士兰"
          },
          {
              "pid": "3",
              "id": "229",
              "txt": "毛里塔尼亚"
          },
          {
              "pid": "3",
              "id": "230",
              "txt": "毛里求斯"
          },
          {
              "pid": "3",
              "id": "231",
              "txt": "津巴布韦"
          },
          {
              "pid": "3",
              "id": "232",
              "txt": "留尼汪"
          },
          {
              "pid": "3",
              "id": "233",
              "txt": "科摩罗"
          },
          {
              "pid": "3",
              "id": "234",
              "txt": "科特迪瓦"
          },
          {
              "pid": "3",
              "id": "235",
              "txt": "突尼斯"
          },
          {
              "pid": "3",
              "id": "236",
              "txt": "索马里"
          },
          {
              "pid": "3",
              "id": "237",
              "txt": "纳米比亚"
          },
          {
              "pid": "3",
              "id": "238",
              "txt": "肯尼亚"
          },
          {
              "pid": "3",
              "id": "239",
              "txt": "苏丹"
          },
          {
              "pid": "3",
              "id": "240",
              "txt": "英属印度洋领地"
          },
          {
              "pid": "3",
              "id": "241",
              "txt": "莫桑比克"
          },
          {
              "pid": "3",
              "id": "242",
              "txt": "莱索托"
          },
          {
              "pid": "3",
              "id": "243",
              "txt": "贝宁"
          },
          {
              "pid": "3",
              "id": "244",
              "txt": "赞比亚"
          },
          {
              "pid": "3",
              "id": "245",
              "txt": "赤道几内亚"
          },
          {
              "pid": "3",
              "id": "246",
              "txt": "阿尔及利亚"
          },
          {
              "pid": "3",
              "id": "247",
              "txt": "马拉维"
          },
          {
              "pid": "3",
              "id": "248",
              "txt": "马约特"
          },
          {
              "pid": "3",
              "id": "249",
              "txt": "马达加斯加"
          },
          {
              "pid": "3",
              "id": "250",
              "txt": "马里"
          }
      ]
  },
  {
      "id": "4",
      "txt": "南美洲",
      "curr": false,
      "children": [
          {
              "pid": "4",
              "id": "53",
              "txt": "阿根廷"
          },
          {
              "pid": "4",
              "id": "105",
              "txt": "乌拉圭"
          },
          {
              "pid": "4",
              "id": "106",
              "txt": "厄瓜多尔"
          },
          {
              "pid": "4",
              "id": "107",
              "txt": "哥伦比亚"
          },
          {
              "pid": "4",
              "id": "108",
              "txt": "圭亚那"
          },
          {
              "pid": "4",
              "id": "109",
              "txt": "委内瑞拉"
          },
          {
              "pid": "4",
              "id": "110",
              "txt": "巴拉圭"
          },
          {
              "pid": "4",
              "id": "111",
              "txt": "巴西"
          },
          {
              "pid": "4",
              "id": "112",
              "txt": "智利"
          },
          {
              "pid": "4",
              "id": "113",
              "txt": "法属圭亚那"
          },
          {
              "pid": "4",
              "id": "114",
              "txt": "玻利维亚"
          },
          {
              "pid": "4",
              "id": "115",
              "txt": "秘鲁"
          },
          {
              "pid": "4",
              "id": "116",
              "txt": "苏里南"
          },
          {
              "pid": "4",
              "id": "117",
              "txt": "马尔维纳斯群岛(福克兰)"
          }
      ]
  },
  {
      "id": "5",
      "txt": "北美洲",
      "curr": false,
      "children": [
          {
              "pid": "5",
              "id": "3",
              "txt": "荷兰加勒比区"
          },
          {
              "pid": "5",
              "id": "4",
              "txt": "蒙塞拉特岛"
          },
          {
              "pid": "5",
              "id": "60",
              "txt": "伯利兹"
          },
          {
              "pid": "5",
              "id": "61",
              "txt": "加拿大"
          },
          {
              "pid": "5",
              "id": "62",
              "txt": "危地马拉"
          },
          {
              "pid": "5",
              "id": "63",
              "txt": "古巴"
          },
          {
              "pid": "5",
              "id": "64",
              "txt": "哥斯达黎加"
          },
          {
              "pid": "5",
              "id": "65",
              "txt": "圣卢西亚"
          },
          {
              "pid": "5",
              "id": "66",
              "txt": "圣基茨和尼维斯"
          },
          {
              "pid": "5",
              "id": "67",
              "txt": "圣巴泰勒米岛"
          },
          {
              "pid": "5",
              "id": "68",
              "txt": "圣文森特和格林纳丁斯"
          },
          {
              "pid": "5",
              "id": "69",
              "txt": "圣皮埃尔和密克隆"
          },
          {
              "pid": "5",
              "id": "70",
              "txt": "墨西哥"
          },
          {
              "pid": "5",
              "id": "71",
              "txt": "多米尼克"
          },
          {
              "pid": "5",
              "id": "72",
              "txt": "多米尼加"
          },
          {
              "pid": "5",
              "id": "73",
              "txt": "安圭拉"
          },
          {
              "pid": "5",
              "id": "74",
              "txt": "安提瓜和巴布达"
          },
          {
              "pid": "5",
              "id": "75",
              "txt": "尼加拉瓜"
          },
          {
              "pid": "5",
              "id": "76",
              "txt": "巴哈马"
          },
          {
              "pid": "5",
              "id": "77",
              "txt": "巴巴多斯"
          },
          {
              "pid": "5",
              "id": "78",
              "txt": "巴拿马"
          },
          {
              "pid": "5",
              "id": "79",
              "txt": "库拉索"
          },
          {
              "pid": "5",
              "id": "80",
              "txt": "开曼群岛"
          },
          {
              "pid": "5",
              "id": "81",
              "txt": "格林纳达"
          },
          {
              "pid": "5",
              "id": "82",
              "txt": "格陵兰"
          },
          {
              "pid": "5",
              "id": "83",
              "txt": "法属圣马丁"
          },
          {
              "pid": "5",
              "id": "84",
              "txt": "波多黎各"
          },
          {
              "pid": "5",
              "id": "85",
              "txt": "洪都拉斯"
          },
          {
              "pid": "5",
              "id": "86",
              "txt": "海地"
          },
          {
              "pid": "5",
              "id": "87",
              "txt": "牙买加"
          },
          {
              "pid": "5",
              "id": "88",
              "txt": "特克斯和凯科斯群岛"
          },
          {
              "pid": "5",
              "id": "89",
              "txt": "特立尼达和多巴哥"
          },
          {
              "pid": "5",
              "id": "90",
              "txt": "瓜德罗普"
          },
          {
              "pid": "5",
              "id": "91",
              "txt": "百慕大"
          },
          {
              "pid": "5",
              "id": "92",
              "txt": "美国"
          },
          {
              "pid": "5",
              "id": "93",
              "txt": "美国本土外小岛屿"
          },
          {
              "pid": "5",
              "id": "94",
              "txt": "美属维尔京群岛"
          },
          {
              "pid": "5",
              "id": "95",
              "txt": "英属维尔京群岛"
          },
          {
              "pid": "5",
              "id": "96",
              "txt": "荷属圣马丁"
          },
          {
              "pid": "5",
              "id": "97",
              "txt": "萨尔瓦多"
          },
          {
              "pid": "5",
              "id": "98",
              "txt": "阿鲁巴"
          },
          {
              "pid": "5",
              "id": "99",
              "txt": "马提尼克"
          },
          {
              "pid": "5",
              "id": "251",
              "txt": "博奈尔"
          }
      ]
  },
  {
      "id": "6",
      "txt": "大洋洲",
      "curr": false,
      "children": [
          {
              "pid": "6",
              "id": "118",
              "txt": "关岛"
          },
          {
              "pid": "6",
              "id": "119",
              "txt": "北马里亚纳群岛"
          },
          {
              "pid": "6",
              "id": "120",
              "txt": "图瓦卢"
          },
          {
              "pid": "6",
              "id": "121",
              "txt": "基里巴斯"
          },
          {
              "pid": "6",
              "id": "122",
              "txt": "密克罗尼西亚联邦"
          },
          {
              "pid": "6",
              "id": "123",
              "txt": "巴布亚新几内亚"
          },
          {
              "pid": "6",
              "id": "124",
              "txt": "帕劳"
          },
          {
              "pid": "6",
              "id": "125",
              "txt": "库克群岛"
          },
          {
              "pid": "6",
              "id": "126",
              "txt": "所罗门群岛"
          },
          {
              "pid": "6",
              "id": "127",
              "txt": "托克劳"
          },
          {
              "pid": "6",
              "id": "128",
              "txt": "斐济群岛"
          },
          {
              "pid": "6",
              "id": "129",
              "txt": "新喀里多尼亚"
          },
          {
              "pid": "6",
              "id": "130",
              "txt": "新西兰"
          },
          {
              "pid": "6",
              "id": "131",
              "txt": "汤加"
          },
          {
              "pid": "6",
              "id": "132",
              "txt": "法属波利尼西亚"
          },
          {
              "pid": "6",
              "id": "133",
              "txt": "澳大利亚"
          },
          {
              "pid": "6",
              "id": "134",
              "txt": "瑙鲁"
          },
          {
              "pid": "6",
              "id": "135",
              "txt": "瓦利斯和富图纳"
          },
          {
              "pid": "6",
              "id": "136",
              "txt": "瓦努阿图"
          },
          {
              "pid": "6",
              "id": "137",
              "txt": "皮特凯恩群岛"
          },
          {
              "pid": "6",
              "id": "138",
              "txt": "纽埃"
          },
          {
              "pid": "6",
              "id": "139",
              "txt": "美属萨摩亚"
          },
          {
              "pid": "6",
              "id": "140",
              "txt": "萨摩亚"
          },
          {
              "pid": "6",
              "id": "141",
              "txt": "诺福克岛"
          },
          {
              "pid": "6",
              "id": "142",
              "txt": "马绍尔群岛"
          }
      ]
  },
  {
      "id": "7",
      "txt": "南极洲",
      "curr": false,
      "children": [
          {
              "pid": "7",
              "id": "100",
              "txt": "南乔治亚岛和南桑威奇群岛"
          },
          {
              "pid": "7",
              "id": "101",
              "txt": "南极洲"
          },
          {
              "pid": "7",
              "id": "102",
              "txt": "布韦岛"
          },
          {
              "pid": "7",
              "id": "103",
              "txt": "法属南部领地"
          },
          {
              "pid": "7",
              "id": "104",
              "txt": "赫德岛和麦克唐纳群岛"
          }
      ]
  }
];

module.exports = [ 
  {
    url: '/common/city',
    type: 'post',
    response() {
      return [
        "深圳", "北京", "广州","上海"
      ]
    },
  },
  {
    url: '/common/country',
    type: 'post',
    response() {
      return countryList
    },
  },
]
